УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_Полномочия/КонтурЛогистика_Полномочия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_Полномочия</name>
  <enumValues>
    <name>ПодписаниеЭТРН</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеЭПЛ</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеЗЗ</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_Полномочия/ManagerModule.bsl
Функция ПолучитьПолномочиеПоТипуЛогистическогоДокумента(ТипЛогистика, ТребуемоеДействие = Неопределено) Экспорт
	
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипЛогистика) Тогда
		
		// TODO: добавить условие выбора полномочия по требуемому действию
		Возврат Перечисления.КонтурЛогистика_Полномочия.ПодписаниеЗЗ;
		
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипЛогистика) Тогда
		
		Возврат Перечисления.КонтурЛогистика_Полномочия.ПодписаниеЭПЛ;
		
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипЛогистика) Тогда
		
		Возврат Перечисления.КонтурЛогистика_Полномочия.ПодписаниеЭТРН;
		
	КонецЕсли;
	
КонецФункции
